# frozen_string_literal: true

tap 'adoptopenjdk/openjdk'
tap 'appveyor/brew'
tap 'aylei/tap'
tap 'coursier/formulas'
tap 'esolitos/ipa'
tap 'go-vela/vela'
tap 'hashicorp/tap'
tap 'he3-app/he3'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'kevin197011/tap'
tap 'kubeshop/monokle'
tap 'pulumi/tap'
tap 'puppetlabs/puppet'
tap 'sakz/tap'
tap 'xpipe-io/tap'
brew 'glib'
brew 'xz'
brew 'harfbuzz'
brew 'librsvg'
brew 'ca-certificates'
brew 'openssl@3'
brew 'cryptography'
brew 'libssh'
brew 'ansible'
brew 'antigen'
brew 'webp'
brew 'libssh2'
brew 'aria2'
brew 'ruby'
brew 'asciidoctor'
brew 'asdf'
brew 'automake'
brew 'python@3.12'
brew 'awscli'
brew 'ncurses'
brew 'bzip2'
brew 'cfssl'
brew 'clang-format'
brew 'cliclick'
brew 'cmake'
brew 'coreutils'
brew 'cowsay'
brew 'cpanminus'
brew 'pkgconf'
brew 'crystal'
brew 'rtmpdump'
brew 'curl'
brew 'd2'
brew 'direnv'
brew 'docker'
brew 'dos2unix'
brew 'doxygen'
brew 'erlang'
brew 'elixir'
brew 'p11-kit'
brew 'unbound'
brew 'gnutls'
brew 'emacs'
brew 'exploitdb'
brew 'fanyiweb'
brew 'tesseract'
brew 'ffmpeg'
brew 'openjdk'
brew 'fop'
brew 'gawk'
brew 'gcc'
brew 'gh'
brew 'git'
brew 'git-filter-repo'
brew 'git-lfs'
brew 'gnu-tar'
brew 'gnupg'
brew 'go'
brew 'gradle'
brew 'jasper'
brew 'graphviz'
brew 'groonga'
brew 'groovy'
brew 'helm'
brew 'htop'
brew 'httpie'
brew 'openssl@1.1'
brew 'httrack'
brew 'hugo'
brew 'jq'
brew 'jsonnet'
brew 'jsonnet-bundler'
brew 'k9s'
brew 'kind'
brew 'kompose'
brew 'kotlin'
brew 'krb5'
brew 'kubernetes-cli'
brew 'lbzip2'
brew 'libfido2'
brew 'libgit2'
brew 'libproxy'
brew 'llvm'
brew 'llvm@9'
brew 'lzlib'
brew 'mariadb'
brew 'mas'
brew 'maven'
brew 'minikube'
brew 'mitmproxy'
brew 'mtr'
brew 'mycli'
brew 'navi'
brew 'neovim'
brew 'nghttp2'
brew 'nim'
brew 'nmap'
brew 'node'
brew 'nuget'
brew 'openjdk@11'
brew 'openjdk@17'
brew 'openjdk@8'
brew 'p7zip'
brew 'tree'
brew 'pass'
brew 'pdm'
brew 'pipenv'
brew 'postgresql@14'
brew 'pulumi'
brew 'qt'
brew 'pyqt'
brew 'python@3.10'
brew 'python@3.9'
brew 'qemu'
brew 'rate'
brew 'ruby-build'
brew 'rbenv-chefdk'
brew 'redis', restart_service: :changed
brew 'rename'
brew 'rke'
brew 'ruby@3.0'
brew 'rust'
brew 'sbt'
brew 'scala'
brew 'shadowenv'
brew 'shfmt'
brew 'sip'
brew 'skaffold'
brew 'sniffnet'
brew 'steampipe'
brew 'swagger-codegen'
brew 'tanka'
brew 'tcl-tk'
brew 'teleport'
brew 'telnet'
brew 'terraform'
brew 'terramate'
brew 'tldr'
brew 'trzsz-ssh'
brew 'virt-manager'
brew 'websocat'
brew 'wget'
brew 'wireshark'
brew 'yamlfmt'
brew 'yarn'
brew 'yq'
brew 'yt-dlp'
brew 'zig'
brew 'zlib'
brew 'zplug'
brew 'zsh'
brew 'zsh-completions'
brew 'coursier/formulas/coursier'
brew 'esolitos/ipa/sshpass'
brew 'go-vela/vela/vela'
brew 'hashicorp/tap/packer'
brew 'hashicorp/tap/vault'
brew 'kevin197011/tap/ip-api'
brew 'sakz/tap/fanyi'
cask 'alfred'
cask 'anydesk'
cask 'betterdisplay'
cask 'bob'
cask 'bruno'
cask 'burp-suite'
cask 'calibre'
cask 'cheatsheet'
cask 'chef-workstation'
cask 'chromedriver'
cask 'claude'
cask 'cursor'
cask 'dbeaver-community'
cask 'dbgate'
cask 'dotnet-sdk'
cask 'downie'
cask 'drawio'
cask 'evernote'
cask 'fig'
cask 'firefox'
cask 'google-cloud-sdk'
cask 'hammerspoon'
cask 'he3'
cask 'iina'
cask 'intellij-idea'
cask 'istat-menus'
cask 'iterm2'
cask 'itsycal'
cask 'jd-gui'
cask 'joplin'
cask 'keepassxc'
cask 'kite'
cask 'lens'
cask 'livebook'
cask 'maczip'
cask 'meld'
cask 'menumeters'
cask 'messenger'
cask 'metasploit'
cask 'microsoft-onenote'
cask 'microsoft-remote-desktop'
cask 'mono-mdk-for-visual-studio'
cask 'mos'
cask 'notion'
cask 'obs'
cask 'odbc-manager'
cask 'omnissa-horizon-client'
cask 'only-switch'
cask 'openvpn-connect'
cask 'pdk'
cask 'poe'
cask 'postman'
cask 'puppet-bolt'
cask 'pycharm'
cask 'pycharm-ce'
cask 'redis-insight'
cask 'reqable'
cask 'scroll-reverser'
cask 'shuttle'
cask 'sketchbook'
cask 'skype'
cask 'sourcetree'
cask 'spotify'
cask 'staruml'
cask 'stats'
cask 'switchhosts'
cask 'teamviewer'
cask 'telegram'
cask 'textmate'
cask 'utm'
cask 'vagrant'
cask 'vagrant-manager'
cask 'virtualbox@6'
cask 'visual-studio-code'
cask 'vlc'
cask 'vmware-fusion'
cask 'warp'
cask 'whatsapp'
cask 'wpsoffice'
cask 'xmind'
cask 'youdaodict'
cask 'zoom'
mas 'Amphetamine', id: 937_984_704
mas 'iMovie 剪辑', id: 408_981_434
mas 'iShot', id: 1_485_844_094
mas 'Keynote 讲演', id: 409_183_694
mas 'Microsoft Remote Desktop', id: 1_295_203_466
mas 'MindNode', id: 1_289_197_285
mas 'Numbers 表格', id: 409_203_825
mas 'Outline', id: 1_356_178_125
mas 'Pages 文稿', id: 409_201_541
mas 'Slack', id: 803_453_959
mas 'The Unarchiver', id: 425_424_353
mas 'Type Fu', id: 509_818_877
mas 'VMware Remote Console', id: 1_230_249_825
mas 'WhatsApp', id: 310_633_997
mas 'Xcode', id: 497_799_835
mas '库乐队', id: 682_658_836
mas '欧路词典', id: 434_350_458
vscode 'aliariff.vscode-erb-beautify'
vscode 'bung87.rails'
vscode 'bung87.vscode-gemfile'
vscode 'docker.docker'
vscode 'ecmel.vscode-html-css'
vscode 'editorconfig.editorconfig'
vscode 'esbenp.prettier-vscode'
vscode 'formulahendry.code-runner'
vscode 'fredwangwang.vscode-hcl-format'
vscode 'genieai.chatgpt-vscode'
vscode 'github.copilot'
vscode 'github.copilot-chat'
vscode 'golang.go'
vscode 'google.geminicodeassist'
vscode 'googlecloudtools.cloudcode'
vscode 'hashicorp.hcl'
vscode 'k--kato.intellij-idea-keybindings'
vscode 'koichisasada.vscode-rdbg'
vscode 'manuelpuyol.erb-linter'
vscode 'mechatroner.rainbow-csv'
vscode 'mindaro-dev.file-downloader'
vscode 'misogi.ruby-rubocop'
vscode 'mkhl.shfmt'
vscode 'ms-azuretools.vscode-docker'
vscode 'ms-python.debugpy'
vscode 'ms-python.python'
vscode 'ms-python.vscode-pylance'
vscode 'ms-vscode-remote.remote-containers'
vscode 'pkief.material-icon-theme'
vscode 'shopify.ruby-extensions-pack'
vscode 'shopify.ruby-lsp'
vscode 'sianglim.slim'
vscode 'sorbet.sorbet-vscode-extension'
vscode 'techer.open-in-browser'
vscode 'withfig.fig'
vscode 'ymotongpoo.licenser'
