# frozen_string_literal: true

tap 'adoptopenjdk/openjdk'
tap 'appveyor/brew'
tap 'aylei/tap'
tap 'coursier/formulas'
tap 'esolitos/ipa'
tap 'go-vela/vela'
tap 'hashicorp/tap'
tap 'he3-app/he3'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'kevin197011/tap'
tap 'kubeshop/monokle'
tap 'pulumi/tap'
tap 'puppetlabs/puppet'
tap 'sakz/tap'
tap 'slashbaseide/tap'
brew 'ca-certificates'
brew 'openssl@3'
brew 'cryptography'
brew 'xz'
brew 'ansible'
brew 'antigen'
brew 'webp'
brew 'libssh2'
brew 'aria2'
brew 'asciidoctor'
brew 'automake'
brew 'coreutils'
brew 'asdf'
brew 'awscli'
brew 'bzip2'
brew 'glib'
brew 'cfssl'
brew 'clang-format'
brew 'cmake'
brew 'cowsay'
brew 'cpanminus'
brew 'llvm'
brew 'crystal'
brew 'rtmpdump'
brew 'curl'
brew 'd2'
brew 'docker', link: false
brew 'docker-compose', link: false
brew 'dos2unix'
brew 'erlang'
brew 'elixir'
brew 'p11-kit'
brew 'unbound'
brew 'gnutls'
brew 'emacs'
brew 'exploitdb'
brew 'fanyiweb'
brew 'gcc'
brew 'libssh'
brew 'ffmpeg'
brew 'openjdk'
brew 'fop'
brew 'gawk'
brew 'gh'
brew 'git'
brew 'git-filter-repo'
brew 'git-lfs'
brew 'gnupg'
brew 'go'
brew 'gradle'
brew 'jasper'
brew 'librsvg'
brew 'graphviz'
brew 'groovy'
brew 'helm'
brew 'ncurses'
brew 'htop'
brew 'httpie'
brew 'openssl@1.1'
brew 'httrack'
brew 'hugo'
brew 'jq'
brew 'jsonnet'
brew 'jsonnet-bundler'
brew 'k9s'
brew 'kind'
brew 'kompose'
brew 'kotlin'
brew 'krb5'
brew 'kubernetes-cli'
brew 'lbzip2'
brew 'libfido2'
brew 'libproxy'
brew 'llvm@9'
brew 'lzlib'
brew 'mariadb'
brew 'mas'
brew 'maven'
brew 'minikube'
brew 'mitmproxy'
brew 'mtr'
brew 'mycli'
brew 'navi'
brew 'neovim'
brew 'nghttp2'
brew 'nim'
brew 'nmap'
brew 'node'
brew 'nuget'
brew 'openjdk@11'
brew 'openjdk@17'
brew 'openjdk@8'
brew 'tree'
brew 'pass'
brew 'pdm'
brew 'pipenv'
brew 'postgresql@14'
brew 'pulumi'
brew 'qt'
brew 'pyqt'
brew 'python@3.10'
brew 'python@3.9'
brew 'rate'
brew 'ruby-build'
brew 'rbenv-chefdk'
brew 'redis', restart_service: true
brew 'rename'
brew 'rke'
brew 'ruby@3.0'
brew 'rust'
brew 'sbt'
brew 'scala'
brew 'shadowenv'
brew 'shfmt'
brew 'sip'
brew 'skaffold'
brew 'sniffnet'
brew 'steampipe'
brew 'tanka'
brew 'tcl-tk'
brew 'teleport'
brew 'telnet'
brew 'terraform'
brew 'terramate'
brew 'tldr'
brew 'websocat'
brew 'wget'
brew 'wireshark'
brew 'yamlfmt'
brew 'yarn'
brew 'youtube-dl'
brew 'yq'
brew 'zig'
brew 'zlib'
brew 'zplug'
brew 'zsh'
brew 'coursier/formulas/coursier'
brew 'esolitos/ipa/sshpass'
brew 'go-vela/vela/vela'
brew 'hashicorp/tap/vault'
brew 'kevin197011/tap/ip-api'
brew 'sakz/tap/fanyi'
cask 'alfred'
cask 'anydesk'
cask 'burp-suite'
cask 'calibre'
cask 'cheatsheet'
cask 'chromedriver'
cask 'dbeaver-community'
cask 'dbgate'
cask 'dotnet-sdk'
cask 'eclipse-installer'
cask 'eclipse-jee'
cask 'evernote'
cask 'fig'
cask 'firefox'
cask 'google-cloud-sdk'
cask 'hammerspoon'
cask 'he3'
cask 'iina'
cask 'intellij-idea'
cask 'istat-menus'
cask 'iterm2'
cask 'itsycal'
cask 'jd-gui'
cask 'keepassxc'
cask 'kite'
cask 'lens'
cask 'meld'
cask 'menumeters'
cask 'messenger'
cask 'metasploit'
cask 'mono-mdk-for-visual-studio'
cask 'notion'
cask 'odbc-manager'
cask 'only-switch'
cask 'pdk'
cask 'pgadmin4'
cask 'postman'
cask 'puppet-bolt'
cask 'pycharm'
cask 'pycharm-ce'
cask 'qtpass'
cask 'redisinsight'
cask 'reqable'
cask 'sequel-ace'
cask 'shuttle'
cask 'sketchbook'
cask 'skype'
cask 'sourcetree'
cask 'spotify'
cask 'staruml'
cask 'stats'
cask 'switchhosts'
cask 'teamviewer'
cask 'telegram'
cask 'textmate'
cask 'vagrant'
cask 'vagrant-manager'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vmware-horizon-client'
cask 'warp'
cask 'whatsapp'
cask 'xmind'
cask 'youdaodict'
cask 'zoom'
mas 'Amphetamine', id: 937_984_704
mas 'iMovie 剪辑', id: 408_981_434
mas 'iShot', id: 1_485_844_094
mas 'Keynote 讲演', id: 409_183_694
mas 'Microsoft Remote Desktop', id: 1_295_203_466
mas 'MindNode', id: 1_289_197_285
mas 'Numbers 表格', id: 409_203_825
mas 'Outline', id: 1_356_178_125
mas 'Pages 文稿', id: 409_201_541
mas 'Slack', id: 803_453_959
mas 'The Unarchiver', id: 425_424_353
mas 'Type Fu', id: 509_818_877
mas 'VMware Remote Console', id: 1_230_249_825
mas 'Xcode', id: 497_799_835
mas '库乐队', id: 682_658_836
mas '欧路词典', id: 434_350_458
vscode 'ahmadalli.vscode-nginx-conf'
vscode 'aldijav.golangwithdidi'
vscode 'alefragnani.project-manager'
vscode 'aliariff.vscode-erb-beautify'
vscode 'aminer.codegeex'
vscode 'angular.ng-template'
vscode 'animus-coop.vscode-elixir-mix-formatter'
vscode 'batisteo.vscode-django'
vscode 'bbenoist.vagrant'
vscode 'bmalehorn.shell-syntax'
vscode 'breadnaught.vscode-ignore'
vscode 'bung87.rails'
vscode 'bung87.vscode-gemfile'
vscode 'caarlos0.language-prometheus'
vscode 'castwide.solargraph'
vscode 'chef-software.chef'
vscode 'chouzz.vscode-better-align'
vscode 'christian-kohler.path-intellisense'
vscode 'cjay.ruby-and-rails-snippets'
vscode 'codeinchinese.englishchinesedictionary'
vscode 'codeium.codeium'
vscode 'codezombiech.gitignore'
vscode 'compilenix.vscode-zonefile'
vscode 'coolbear.systemd-unit-file'
vscode 'craigmaslowski.erb'
vscode 'crystal-lang-tools.crystal-lang'
vscode 'd4nyll.devops-extension-pack'
vscode 'd9705996.perl-toolbox'
vscode 'davidanson.vscode-markdownlint'
vscode 'donjayamanne.githistory'
vscode 'dotjoshjohnson.xml'
vscode 'eamodio.gitlens'
vscode 'editorconfig.editorconfig'
vscode 'emeraldwalk.runonsave'
vscode 'eriklynd.json-tools'
vscode 'esbenp.prettier-vscode'
vscode 'evzen-wybitul.magic-racket'
vscode 'florinpatrascu.vscode-elixir-snippets'
vscode 'formulahendry.code-runner'
vscode 'formulahendry.terminal'
vscode 'foxundermoon.shell-format'
vscode 'fwcd.kotlin'
vscode 'ginfuru.ginfuru-vscode-jekyll-syntax'
vscode 'ginfuru.vscode-jekyll-snippets'
vscode 'github.github-vscode-theme'
vscode 'github.vscode-github-actions'
vscode 'github.vscode-pull-request-github'
vscode 'golang.go'
vscode 'grapecity.gc-excelviewer'
vscode 'hashicorp.terraform'
vscode 'hediet.vscode-drawio'
vscode 'honnamkuan.golang-snippets'
vscode 'humao.rest-client'
vscode 'ibm.output-colorizer'
vscode 'ipedrazas.kubernetes-snippets'
vscode 'ivory-lab.jenkinsfile-support'
vscode 'jakebecker.elixir-ls'
vscode 'janjoerke.jenkins-pipeline-linter-connector'
vscode 'jeff-hykin.better-perl-syntax'
vscode 'k--kato.intellij-idea-keybindings'
vscode 'knowsuchagency.pdm-task-provider'
vscode 'koichisasada.vscode-rdbg'
vscode 'kosz78.nim'
vscode 'lkrms.inifmt'
vscode 'lorankloeze.ruby-rubocop-revived'
vscode 'lorenzopirro.zig-snippets'
vscode 'lynxish-developer.moonscript'
vscode 'marclipovsky.string-manipulation'
vscode 'marcostazi.vs-code-vagrantfile'
vscode 'marlon407.code-groovy'
vscode 'mellowmarshmallow.groovy'
vscode 'mikestead.dotenv'
vscode 'misogi.ruby-rubocop'
vscode 'mrmlnc.vscode-apache'
vscode 'mrorz.language-gettext'
vscode 'ms-azuretools.vscode-docker'
vscode 'ms-ceintl.vscode-language-pack-zh-hans'
vscode 'ms-kubernetes-tools.vscode-kubernetes-tools'
vscode 'ms-python.autopep8'
vscode 'ms-python.black-formatter'
vscode 'ms-python.debugpy'
vscode 'ms-python.isort'
vscode 'ms-python.python'
vscode 'ms-python.vscode-pylance'
vscode 'ms-toolsai.jupyter'
vscode 'ms-toolsai.jupyter-keymap'
vscode 'ms-toolsai.jupyter-renderers'
vscode 'ms-toolsai.vscode-jupyter-cell-tags'
vscode 'ms-toolsai.vscode-jupyter-slideshow'
vscode 'ms-vscode-remote.remote-ssh'
vscode 'ms-vscode-remote.remote-ssh-edit'
vscode 'ms-vscode.cmake-tools'
vscode 'ms-vscode.cpptools'
vscode 'ms-vscode.cpptools-extension-pack'
vscode 'ms-vscode.cpptools-themes'
vscode 'ms-vscode.makefile-tools'
vscode 'ms-vscode.powershell'
vscode 'ms-vscode.remote-explorer'
vscode 'mtxr.sqltools'
vscode 'mtxr.sqltools-driver-mysql'
vscode 'mwpb.java-prettier-formatter'
vscode 'naco-siren.gradle-language'
vscode 'neonxp.gotools'
vscode 'nhoizey.gremlins'
vscode 'nicolasvuillamy.vscode-groovy-lint'
vscode 'pavlitsky.yard'
vscode 'phoenixframework.phoenix'
vscode 'pkief.material-icon-theme'
vscode 'platformio.platformio-ide'
vscode 'pnp.polacode'
vscode 'premparihar.gotestexplorer'
vscode 'puppet.puppet-vscode'
vscode 'pwwang.gptcommit'
vscode 'qezhu.gitlink'
vscode 'quicktype.quicktype'
vscode 'randomchance.logstash'
vscode 'raynigon.nginx-formatter'
vscode 'rebornix.ruby'
vscode 'recode4dev.jenkinsfile'
vscode 'redhat.fabric8-analytics'
vscode 'redhat.java'
vscode 'redhat.vscode-xml'
vscode 'redhat.vscode-yaml'
vscode 'richterger.perl'
vscode 'ritvyk.heex-html'
vscode 'ritwickdey.liveserver'
vscode 'robert.ruby-snippet'
vscode 'rohinivsenthil.postcode'
vscode 'rust-lang.rust-analyzer'
vscode 'samuel-pordeus.elixir-test'
vscode 'samuelcolvin.jinjahtml'
vscode 'saratravi.elixir-formatter'
vscode 'scala-lang.scala'
vscode 'scala-lang.scala-snippets'
vscode 'scalameta.metals'
vscode 'secanis.jenkinsfile-support'
vscode 'shardulm94.trailing-spaces'
vscode 'shopify.ruby-extensions-pack'
vscode 'shopify.ruby-lsp'
vscode 'shopify.vscode-shadowenv'
vscode 'sianglim.slim'
vscode 'sissel.shopify-liquid'
vscode 'sorbet.sorbet-vscode-extension'
vscode 'soutaro.rbs-syntax'
vscode 'spmeesseman.vscode-taskexplorer'
vscode 'streetsidesoftware.code-spell-checker'
vscode 'tabnine.tabnine-vscode'
vscode 'tamasfe.even-better-toml'
vscode 'techer.open-in-browser'
vscode 'technosophos.vscode-helm'
vscode 'teclado.vscode-nginx-format'
vscode 'terrastruct.d2'
vscode 'thenuprojectcontributors.vscode-nushell-lang'
vscode 'timonwong.shellcheck'
vscode 'truman.autocomplate-shell'
vscode 'twxs.cmake'
vscode 'unbug.codelf'
vscode 'vaughan.rdoc-readme'
vscode 'vgalaktionov.moonscript'
vscode 'visualstudioexptteam.intellicode-api-usage-examples'
vscode 'visualstudioexptteam.vscodeintellicode'
vscode 'vscjava.vscode-gradle'
vscode 'vscjava.vscode-java-debug'
vscode 'vscjava.vscode-java-dependency'
vscode 'vscjava.vscode-java-pack'
vscode 'vscjava.vscode-java-test'
vscode 'vscjava.vscode-maven'
vscode 'vscjava.vscode-spring-initializr'
vscode 'vscode-icons-team.vscode-icons'
vscode 'vscodevim.vim'
vscode 'vsmalone.perl-format'
vscode 'william-voyek.vscode-nginx'
vscode 'wingrunr21.vscode-ruby'
vscode 'withfig.fig'
vscode 'wmaurer.change-case'
vscode 'wscats.search'
vscode 'xaver.clang-format'
vscode 'ymotongpoo.licenser'
vscode 'yokoe.vscode-postfix-go'
vscode 'yzane.markdown-pdf'
vscode 'yzhang.markdown-all-in-one'
vscode 'ziglang.vscode-zig'
vscode 'zxh404.vscode-proto3'
