# frozen_string_literal: true

tap 'appveyor/brew'
tap 'aylei/tap'
tap 'coursier/formulas'
tap 'esolitos/ipa'
tap 'hashicorp/tap'
tap 'he3-app/he3'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'pulumi/tap'
tap 'puppetlabs/puppet'
brew 'ca-certificates'
brew 'ansible', link: false
brew 'antigen'
brew 'aria2'
brew 'asdf'
brew 'awscli'
brew 'clang-format'
brew 'cmake'
brew 'cowsay'
brew 'cpanminus'
brew 'crystal'
brew 'd2'
brew 'docker'
brew 'docker-compose'
brew 'wxwidgets'
brew 'erlang'
brew 'elixir'
brew 'emacs'
brew 'exploitdb'
brew 'ffmpeg'
brew 'gcc'
brew 'git'
brew 'gnupg', link: false
brew 'go'
brew 'go@1.15'
brew 'openjdk'
brew 'gradle'
brew 'librsvg'
brew 'graphviz'
brew 'groovy'
brew 'helm'
brew 'htop'
brew 'k9s'
brew 'kind'
brew 'kotlin'
brew 'libssh'
brew 'llvm'
brew 'mariadb'
brew 'maven'
brew 'minikube'
brew 'mtr'
brew 'mycli'
brew 'neovim'
brew 'nmap'
brew 'nuget'
brew 'openjdk@11'
brew 'openjdk@17'
brew 'openjdk@8'
brew 'pass'
brew 'pdm'
brew 'python@3.10'
brew 'python@3.9'
brew 'redis', restart_service: true
brew 'rke'
brew 'ruby@3.0'
brew 'rust'
brew 'sbt'
brew 'scala'
brew 'shadowenv'
brew 'shfmt'
brew 'skaffold'
brew 'steampipe'
brew 'telnet'
brew 'tldr'
brew 'websocat'
brew 'wget'
brew 'wireshark'
brew 'yamlfmt'
brew 'youtube-dl', link: false
brew 'yq'
brew 'zig'
brew 'zlib'
brew 'zplug'
brew 'coursier/formulas/coursier'
brew 'esolitos/ipa/sshpass'
brew 'hashicorp/tap/vault'
brew 'pulumi/tap/pulumi'
cask 'alfred'
cask 'burp-suite'
cask 'calibre'
cask 'clashx'
cask 'dbeaver-community'
cask 'dbgate'
cask 'dotnet-sdk'
cask 'eclipse-installer'
cask 'eclipse-jee'
cask 'firefox'
cask 'google-cloud-sdk'
cask 'he3'
cask 'iterm2'
cask 'jd-gui'
cask 'keepassxc'
cask 'lens'
cask 'meld'
cask 'menumeters'
cask 'metasploit'
cask 'mono-mdk-for-visual-studio'
cask 'notion'
cask 'pdk'
cask 'postman'
cask 'puppet-bolt'
cask 'qtpass'
cask 'racket'
cask 'redisinsight'
cask 'sequel-ace'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'stats'
cask 'switchhosts'
cask 'vagrant'
cask 'vagrant-manager'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'warp'
cask 'xmind'
vscode 'ahmadalli.vscode-nginx-conf'
vscode 'aldijav.golangwithdidi'
vscode 'alefragnani.project-manager'
vscode 'Angular.ng-template'
vscode 'bbenoist.vagrant'
vscode 'Breadnaught.vscode-ignore'
vscode 'bung87.rails'
vscode 'bung87.vscode-gemfile'
vscode 'bungcip.better-toml'
vscode 'castwide.solargraph'
vscode 'chouzz.vscode-better-align'
vscode 'christian-kohler.path-intellisense'
vscode 'Cjay.ruby-and-rails-snippets'
vscode 'CodeInChinese.EnglishChineseDictionary'
vscode 'Codeium.codeium'
vscode 'codezombiech.gitignore'
vscode 'Compilenix.vscode-zonefile'
vscode 'coolbear.systemd-unit-file'
vscode 'crystal-lang-tools.crystal-lang'
vscode 'd4nyll.devops-extension-pack'
vscode 'DavidAnson.vscode-markdownlint'
vscode 'donjayamanne.githistory'
vscode 'DotJoshJohnson.xml'
vscode 'eamodio.gitlens'
vscode 'EditorConfig.EditorConfig'
vscode 'eriklynd.json-tools'
vscode 'esbenp.prettier-vscode'
vscode 'evzen-wybitul.magic-racket'
vscode 'formulahendry.code-runner'
vscode 'foxundermoon.shell-format'
vscode 'fwcd.kotlin'
vscode 'gamedilong.anes'
vscode 'github.vscode-github-actions'
vscode 'GitHub.vscode-pull-request-github'
vscode 'golang.go'
vscode 'hashicorp.terraform'
vscode 'hediet.vscode-drawio'
vscode 'heptio.jsonnet'
vscode 'honnamkuan.golang-snippets'
vscode 'humao.rest-client'
vscode 'IBM.output-colorizer'
vscode 'ipedrazas.kubernetes-snippets'
vscode 'ivory-lab.jenkinsfile-support'
vscode 'jeff-hykin.better-perl-syntax'
vscode 'jpogran.puppet-vscode'
vscode 'k--kato.intellij-idea-keybindings'
vscode 'knowsuchagency.pdm-task-provider'
vscode 'KoichiSasada.vscode-rdbg'
vscode 'lightbend.vscode-sbt-scala'
vscode 'lkrms.inifmt'
vscode 'LoranKloeze.ruby-rubocop-revived'
vscode 'lorenzopirro.zig-snippets'
vscode 'Lynxish-Developer.moonscript'
vscode 'marcostazi.VS-code-vagrantfile'
vscode 'marlon407.code-groovy'
vscode 'mikestead.dotenv'
vscode 'ms-azuretools.vscode-docker'
vscode 'MS-CEINTL.vscode-language-pack-zh-hans'
vscode 'ms-kubernetes-tools.vscode-kubernetes-tools'
vscode 'ms-python.autopep8'
vscode 'ms-python.black-formatter'
vscode 'ms-python.isort'
vscode 'ms-python.python'
vscode 'ms-python.vscode-pylance'
vscode 'ms-toolsai.jupyter'
vscode 'ms-toolsai.jupyter-keymap'
vscode 'ms-toolsai.jupyter-renderers'
vscode 'ms-toolsai.vscode-jupyter-cell-tags'
vscode 'ms-toolsai.vscode-jupyter-slideshow'
vscode 'ms-vscode-remote.remote-ssh'
vscode 'ms-vscode-remote.remote-ssh-edit'
vscode 'ms-vscode.cmake-tools'
vscode 'ms-vscode.cpptools'
vscode 'ms-vscode.cpptools-extension-pack'
vscode 'ms-vscode.cpptools-themes'
vscode 'ms-vscode.makefile-tools'
vscode 'ms-vscode.powershell'
vscode 'ms-vscode.remote-explorer'
vscode 'mtxr.sqltools'
vscode 'mtxr.sqltools-driver-mysql'
vscode 'mwpb.java-prettier-formatter'
vscode 'naco-siren.gradle-language'
vscode 'neonxp.gotools'
vscode 'nhoizey.gremlins'
vscode 'NicolasVuillamy.vscode-groovy-lint'
vscode 'pavlitsky.yard'
vscode 'PKief.material-icon-theme'
vscode 'pnp.polacode'
vscode 'premparihar.gotestexplorer'
vscode 'puppet.puppet-vscode'
vscode 'pwwang.gptcommit'
vscode 'qezhu.gitlink'
vscode 'quicktype.quicktype'
vscode 'RandomChance.logstash'
vscode 'raynigon.nginx-formatter'
vscode 'redhat.fabric8-analytics'
vscode 'redhat.java'
vscode 'redhat.vscode-xml'
vscode 'redhat.vscode-yaml'
vscode 'richterger.perl'
vscode 'robert.ruby-snippet'
vscode 'rohinivsenthil.postcode'
vscode 'rust-lang.rust-analyzer'
vscode 'scala-lang.scala'
vscode 'scala-lang.scala-snippets'
vscode 'scalameta.metals'
vscode 'secanis.jenkinsfile-support'
vscode 'shardulm94.trailing-spaces'
vscode 'Shopify.ruby-extensions-pack'
vscode 'Shopify.ruby-lsp'
vscode 'Shopify.vscode-shadowenv'
vscode 'sianglim.slim'
vscode 'sorbet.sorbet-vscode-extension'
vscode 'soutaro.rbs-syntax'
vscode 'streetsidesoftware.code-spell-checker'
vscode 'techer.open-in-browser'
vscode 'technosophos.vscode-helm'
vscode 'Terrastruct.d2'
vscode 'TheNuProjectContributors.vscode-nushell-lang'
vscode 'twxs.cmake'
vscode 'unbug.codelf'
vscode 'vaughan.rdoc-readme'
vscode 'vgalaktionov.moonscript'
vscode 'VisualStudioExptTeam.intellicode-api-usage-examples'
vscode 'VisualStudioExptTeam.vscodeintellicode'
vscode 'vscjava.vscode-gradle'
vscode 'vscjava.vscode-java-debug'
vscode 'vscjava.vscode-java-dependency'
vscode 'vscjava.vscode-java-pack'
vscode 'vscjava.vscode-java-test'
vscode 'vscjava.vscode-maven'
vscode 'vscjava.vscode-spring-initializr'
vscode 'vscodevim.vim'
vscode 'vsmalone.perl-format'
vscode 'william-voyek.vscode-nginx'
vscode 'wmaurer.change-case'
vscode 'Wscats.search'
vscode 'xaver.clang-format'
vscode 'ymotongpoo.licenser'
vscode 'yokoe.vscode-postfix-go'
vscode 'yzane.markdown-pdf'
vscode 'yzhang.markdown-all-in-one'
vscode 'ziglang.vscode-zig'
vscode 'zxh404.vscode-proto3'
